In [ ]:
#Write a Pandas program to create and display a DataFrame from the following dictionary data which has index labels.
#exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
#'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
#'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
#'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
#labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#1 Print the three first rows using head() method

import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'],
'labels' : ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']}
df = pd.DataFrame(exam_data)
df=df.set_index('labels')
df.head(3)

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes

In [ ]:
#2 Delete rows with Nan values

df.drop(['d', 'h'])

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes
e           Emily    9.0         2      no
f         Michael   20.0         3     yes
g         Matthew   14.5         1     yes
i           Kevin    8.0         2      no
j           Jonas   19.0         1     yes

In [ ]:
#3 Extract the 'name' and 'score' columns from the DataFrame.

df.iloc[:,0:2]

             name  score
labels
a       Anastasia   12.5
b            Dima    9.0
c       Katherine   16.5
d           James    NaN
e           Emily    9.0
f         Michael   20.0
g         Matthew   14.5
h           Laura    NaN
i           Kevin    8.0
j           Jonas   19.0

In [ ]:
#4 Write a Pandas program to append a new row 'k' to data frame with these values(name : "Suresh", score: 15.5, attempts: 1, qualify: "yes")
exam_data2={'name' : ["Suresh"], 'score': [15.5], 'attempts': [1], 'qualify': ["yes"],'labels':["k"]}
df2= pd.DataFrame(exam_data2)
df2=df2.set_index('labels')
df3=pd.concat([df,df2])
print(df3)

             name  score  attempts qualify
labels
a       Anastasia   12.5         1     yes
b            Dima    9.0         3      no
c       Katherine   16.5         2     yes
d           James    NaN         3      no
e           Emily    9.0         2      no
f         Michael   20.0         3     yes
g         Matthew   14.5         1     yes
h           Laura    NaN         1      no
i           Kevin    8.0         2      no
j           Jonas   19.0         1     yes
k          Suresh   15.5         1     yes

In [ ]:
#5 Write a Pandas program to delete the 'attempts' column from the DataFrame.

#df3.drop(columns=['attempts'])
df3.drop('attempts',axis=1)

             name  score qualify
labels
a       Anastasia   12.5     yes
b            Dima    9.0      no
c       Katherine   16.5     yes
d           James    NaN      no
e           Emily    9.0      no
f         Michael   20.0     yes
g         Matthew   14.5     yes
h           Laura    NaN      no
i           Kevin    8.0      no
j           Jonas   19.0     yes
k          Suresh   15.5     yes

In [131]:
#6 Add a new column "Success" : if the score is higher than 10 we will have 1 else we will have 0

df['success'] =(df.score>10)

print(df)

             name  score  attempts qualify  success
labels
a       Anastasia   12.5         1     yes     True
b            Dima    9.0         3      no    False
c       Katherine   16.5         2     yes     True
d           James    NaN         3      no    False
e           Emily    9.0         2      no    False
f         Michael   20.0         3     yes     True
g         Matthew   14.5         1     yes     True
h           Laura    NaN         1      no    False
i           Kevin    8.0         2      no    False
j           Jonas   19.0         1     yes     True

In [132]:
#7 After executing the final dataframe, export it into csv file named "my_data"
df3.to_csv('my_data')